PimpleFoam/shockTube_fvSol_10000/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|U|e).*"
    {
/*
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-15;
        relTol          0;
*/
	solver          PBiCGStab;
	preconditioner  DILU;
	tolerance       1e-15;
	relTol          0.0;
    }

    "rho.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-15;
        relTol          0;
        
        //solver diagonal;
    }
}

PIMPLE
{
    nOuterCorrectors     2;
    nCorrectors          1;
    nNonOrthogonalCorrectors 0;

    transonic            yes;
}

/*
relaxationFactors
{
    fields
    {
        ".*"   1;  // set 1 to ensure diagonal equality
    }
    equations
    {
        ".*"   1;  // set 1 to ensure diagonal equality
    }
}
*/

// ************************************************************************* //
